app/controllers/line_items_controller.rb

def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY "products"."id" ASC LIMIT 1  [["id", 6]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Wed, 04 Mar 2015 18:40:26 UTC +00:00], ["updated_at", Wed, 04 Mar 2015 18:40:26 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 1], ["created_at", Wed, 04 Mar 2015 18:40:26 UTC +00:00], ["product_id", 6], ["updated_at", Wed, 04 Mar 2015 18:40:26 UTC +00:00]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 4  [["quantity", 2], ["updated_at", Thu, 05 Mar 2015 07:22:02 UTC +00:00]]