app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "description", "image_url", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 04 Mar 2015 05:45:57 UTC +00:00], ["description", ""], ["image_url", ""], ["title", "mus"], ["updated_at", Wed, 04 Mar 2015 05:45:57 UTC +00:00]]