app/controllers/store_controller.rb

  def index
    @products = Product.order (:title)
---
SELECT "products".* FROM "products" ORDER BY "products"."updated_at" DESC LIMIT 1